app/Controllers/Admin.php

    public function crudUser()
    {
        $userModel = new UserModel();
        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `users`

    public function storeUser()
    {
        $userModel = new UserModel();

        $data = [
            'nama_lengkap' => $this->request->getPost('nama_lengkap'),
            'username'     => $this->request->getPost('username'),
            'password'     => password_hash((string) $this->request->getPost('password'), PASSWORD_DEFAULT),
            'level'        => $this->request->getPost('level')
        ];

        $userModel->insert($data);
---
INSERT INTO `users` (`nama_lengkap`, `username`, `password`, `level`, `created_at`, `updated_at`) VALUES ('Managerial', 'manager', '$2y$10$Ts20UyWjoPrFyvUjh7i/x.F1owm7/vN8ltkb86uqzFXAvNsyAtPuS', 'MANAGERIAL', '2026-02-28 18:07:13', '2026-02-28 18:07:13')

    public function settingHierarchy()
    {
        $hierarchyModel = new HierarchyModel();
        $userModel = new UserModel();

        // PERBAIKAN: Ubah kata 'hierarchies' menjadi 'user_hierarchy' pada select() dan join()
        $data['hierarchies'] = $hierarchyModel->select('user_hierarchy.*, atasan.nama_lengkap as nama_atasan, atasan.level as level_atasan, bawahan.nama_lengkap as nama_bawahan, bawahan.level as level_bawahan')
                                              ->join('users as atasan', 'atasan.id = user_hierarchy.id_atasan')
                                              ->join('users as bawahan', 'bawahan.id = user_hierarchy.id_bawahan')
                                              ->findAll();
        $data['all_users'] = $userModel->findAll();
---
SELECT `user_hierarchy`.*, `atasan`.`nama_lengkap` as `nama_atasan`, `atasan`.`level` as `level_atasan`, `bawahan`.`nama_lengkap` as `nama_bawahan`, `bawahan`.`level` as `level_bawahan`
FROM `user_hierarchy`
JOIN `users` as `atasan` ON `atasan`.`id` = `user_hierarchy`.`id_atasan`
JOIN `users` as `bawahan` ON `bawahan`.`id` = `user_hierarchy`.`id_bawahan`
SELECT *
FROM `users`

    public function saveHierarchy()
    {
        $hierarchyModel = new HierarchyModel();

        $data = [
            'id_atasan'  => $this->request->getPost('id_atasan'),
            'id_bawahan' => $this->request->getPost('id_bawahan')
        ];

        $hierarchyModel->insert($data);
---
INSERT INTO `user_hierarchy` (`id_atasan`, `id_bawahan`, `created_at`, `updated_at`) VALUES ('5', '4', '2026-02-28 18:12:17', '2026-02-28 18:12:17')

    public function monitorReports()
    {
        $reportModel = new ReportModel();

        $data['reports'] = $reportModel->select('report_submissions.*, users.nama_lengkap as nama_pembuat, users.foto as foto_pembuat')
                                       ->join('users', 'users.id = report_submissions.id_user_staff', 'left')
                                       ->orderBy('report_submissions.created_at', 'DESC')
                                       ->findAll();
---
SELECT `report_submissions`.*, `users`.`nama_lengkap` as `nama_pembuat`, `users`.`foto` as `foto_pembuat`
FROM `report_submissions`
LEFT JOIN `users` ON `users`.`id` = `report_submissions`.`id_user_staff`
ORDER BY `report_submissions`.`created_at` DESC