app/Controllers/StaffProgressController.php

    public function index()
    {
        $userId = session()->get('id');

        $data = [
            'audit_bonds'           => (new AuditBondModel())->where('user_id', $userId)->findAll(),
            'compliance_bonds'      => (new ComplianceBondModel())->where('user_id', $userId)->findAll(),
            'risk_bonds'            => (new RiskBondModel())->where('user_id', $userId)->findAll(),
            'incident_reports'      => (new IncidentReportModel())->where('user_id', $userId)->findAll(),
            'int_audit_bonds'       => (new IntAuditBondModel())->where('user_id', $userId)->findAll(),
            'int_compliance_bonds'  => (new IntComplianceBondModel())->where('user_id', $userId)->findAll(),
            'int_continuity_bonds'  => (new IntContinuityBondModel())->where('user_id', $userId)->findAll(),
            'int_control_bonds'     => (new IntControlBondModel())->where('user_id', $userId)->findAll(),
            'int_cyber_bonds'       => (new IntCyberBondModel())->where('user_id', $userId)->findAll(),
            'int_fraud_bonds'       => (new IntFraudBondModel())->where('user_id', $userId)->findAll(),
            'int_incident_bonds'    => (new IntIncidentBondModel())->where('user_id', $userId)->findAll(),
            'int_risk_bonds'        => (new IntRiskBondModel())->where('user_id', $userId)->findAll(),
            'int_third_party_bonds' => (new IntThirdPartyBondModel())->where('user_id', $userId)->findAll(),
---
SELECT *
FROM `compliance_bonds`
WHERE `user_id` = '2'
SELECT *
FROM `risk_bonds`
WHERE `user_id` = '2'
SELECT *
FROM `incident_reports`
WHERE `user_id` = '2'
SELECT *
FROM `int_audit_bonds`
WHERE `user_id` = '2'
SELECT *
FROM `int_compliance_bonds`
WHERE `user_id` = '2'
SELECT *
FROM `int_continuity_bonds`
WHERE `user_id` = '2'
SELECT *
FROM `int_control_bonds`
WHERE `user_id` = '2'
SELECT *
FROM `int_cyber_bonds`
WHERE `user_id` = '2'
SELECT *
FROM `int_fraud_bonds`
WHERE `user_id` = '2'
SELECT *
FROM `int_incident_bonds`
WHERE `user_id` = '2'
SELECT *
FROM `int_risk_bonds`
WHERE `user_id` = '2'
SELECT *
FROM `int_third_party_bonds`
WHERE `user_id` = '2'