app/Controllers/StaffDataAuditController.php

INSERT INTO `audit_bonds` (`title`, `user_id`, `status`, `current_level`, `created_at`, `updated_at`) VALUES ('Laporan Coba', '2', 'PROSES', 'KEPALA UNIT', '2026-03-01 04:52:06', '2026-03-01 04:52:06')
---
    public function saveAuditBond()
    {
        $model = new AuditBondModel();
        $data = $this->request->getPost();
        $data['user_id'] = session()->get('id');
        $data['status'] = 'PROSES';
        $data['current_level'] = 'KEPALA UNIT';

        $model->insert($data);